docs/docbook/futon4/futon4-ec46e35bad95.org
#+TITLE: Pattern workflows
:PROPERTIES:
:DOC_ID: futon4-ec46e35bad95
:ENTRY_ID: futon4-ec46e35bad95::org
:VERSION: org
:OUTLINE_PATH: Pattern workflows
:PATH_STRING: Pattern workflows
:REPLACES: 
:END:

* Context
The reanimation plan calls out pattern tooling as the last literate piece: we need both the pattern editing helpers and the ingest shims (see docs/reanimation-plan.org) inside the new spine so contributors change Org first and then tangle.

